[
        {
            "cityName": "Bardejov",
            "country": "Slovakia",
            "imageURL": "../img/bardejov.jpg",
            "date": "05.24.2018",
            "lat": "49.2945857",
            "lng": "21.2754012",
            "lede": "<p>“How far these city walls have come,” I thought, gazing from the battlements of Bardejov, over sprawling development, towards the green pastures beyond.</p>",
            "Text": "<p>“How far these city walls have come,” I thought, gazing from the battlements of Bardejov, over sprawling development, towards the green pastures beyond.</p><p>The fortifications of Bardejov’s historic center were erected in 1300s to deter invaders after the city’s great wealth—wealth accumulated from its lucrative trade position between Hungary and Poland. Overtime, the city grew more and more prosperous, eventually being named a royal city by the Hungarian Empire which controlled Slovakia at that time.</p><p>This glory lasted centuries, but industrialization and changing politics after WWI resulted in a violent economic decline and Bardejov became no more than an agricultural backwater, its iconic walled center left to deteriorate.</p><p>The city was, in a sense, rediscovered in the 1950s and money invested back into its declining beauty. Bardejov became the first city in Czechoslovakia to be given the European Gold Medal by the International Board of Trustees in Hamburg for its restoration efforts. In 2000, the renewed city center also earned a place as an UNESCO World Heritage Site.</p><p>Long since made obsolete, the defensive walls of Bardejov do little more today than separate the present from the past—though a worthy defense it is. On one side of the walls, a shopping center and train station funnel the busiest of this small city’s traffic, while on the other pedestrians peacefully stroll, ice creams in hand, along the flawless cobblestone streets. The colorful buildings there-within host everything from butcher’s shops to bookstores to little cafes, but all of them line roads which eventually make their way to the main square. Radničné námestie, in Slovak, is dominated by two structures, the city hall and iconic Basilica of Saint Aegidius. This monumental church holds a wealth of historic alter pieces and other artifacts from the region’s history, though its biggest draw is the tower which… well… towers above the rest of the city.</p><p>After I surveyed the chapel and side chambers, the steward of the church opened the door to the tower for me and I began to climb. There is no more medieval of a feeling as ascending a spiraling staircase shorter than you are and no wider than your shoulders. Every so often a tiny window would look past the churches sloped roofs to the city beyond or a small entryway would lead into a musty chamber above the basilica’s arched naves. Part of me wanted to explore these seemingly abandoned chambers, but the other knew that would likely be looked down upon and settled on reaching the top.</p><p>The view was simply unrivaled by anything I have seen in Slovakia. (I’ll let it speak for itself.)</p><p>Unlike many Slovak cities, Bardejov is preserved to the absolute highest standard. Little advertisement clutters its building’s facades and modern development is forbidden within the historic center. It is a city which has been reminded of past glory and will not allow that to be forgotten again.</p><p>Signed,</p><p> Andrew</p>"
        },
        {
            "cityName": "Poprad",
            "country": "Slovakia",
            "imageURL": "../img/poprad.jpg",
            "date": "08.28.2017",
            "lat": "49.0511221",
            "lng": "20.295414",
            "lede": "<p>Charmingly set beneath the monolithic mountains of the High Tatras, Poprad is a town of winter sporting and medieval beauty. I am delighted to be living in a place that is so near to nature and boasts a long and vibrant—if troubled—past.</p>",
            "Text": "<p>Charmingly set beneath the monolithic mountains of the High Tatras, Poprad is a town of winter sporting and medieval beauty. I am delighted to be living in a place that is so near to nature and boasts a long and vibrant—if troubled—past.</p><p>The city of Poprad sits on a historic intersection of great powers and, like the rest of Slovakia, has served as the rope in Europe’s millennia-long, territorial tug-of-war. Slavic peoples inundated Central and Eastern Europe during the Migration Period (300-700 CE). The earliest records of Poprad’s existence date to the year 1256. Other small villages cropped up in the area shortly before and after this date. These towns included Matejovce, Kvetnica, Spišská Sobota, Veľká, and Stráže. Poprad and these medieval towns first fell under Hungarian rule, where they stayed until the land was captured by Sigismund III’s polish army in 1412. Maria Theresa annexed the land back into the Austro-Hungarian empire in 1772, yet Polish influence had already been ingrained and is still evident the city’s personality.</p><p>In 1919 Poprad was integrated into Czechoslovakia after the dissolution of the Austro-Hungarian Empire, it briefly fell to the Nazis during WWII, then was taken back on the 28th of January, 1945 by Soviet forces. Afterwards, Poprad fell into the communist block with the rest of Eastern Europe, where it remained until 1989 when the Czechs-Slovaks broke free of the Soviet Union. In 1993, free from overhead authority, the nation split peacefully into Slovakia and the Czech Republic. Poprad itself also split around this time. The old nearby towns, which since 1923 had been incorporated into Greater Poprad, became self-governing units and maintain administrative independence to this day.</p><h2>The Sights</h2><p>Despite its tumultuous history, Poprad found much success as a winter sporting resort in the High Tatras. At 2,205 ft (672 m) above sea level, the city experiences all seasons but has a fairly mild climate. However, the surrounding peaks reach towards 9,000 ft (2,700 m), excellent for alpine adventuring. Nearby ski resorts in the Tatra mountains serve countless visitors each year!</p><p>The area’s outdoor attractions are not limited to winter sporting. To the south, Slovensky Raj, or Slovak Paradise, boasts 300 km of trails, 350 caves, numerous waterfalls, and the most unsettling, yet exhilarating, assembly of bridges and ladders throughout its trails. The national park contains 200 species of vertebrates, including bears, lynx, wolves, deer, otters, and boars. Other national parks in the area include Tatras National Park, Pieniny National Park, and the National Park of the Lower Tatras.</p><p>Poprad is the largest city in the Spiš region, but there are many other sights to see! Castles, churches, medieval cities, and festivals, I will explore everything mentioned here and more throughout my stay</p><p>Signed,</p><p>\r\nAndrew</p>"
        },
        {
            "cityName": "Prague",
            "country": "Czechia",
            "imageURL": "../img/prague.jpg",
            "date": "03.15.2018",
            "lat": "50.0755381",
            "lng": "14.4378005",
            "lede": "<p>We arrived in Prague on the doorstep of my host uncle&rsquo;s apartment. Built into a hillside which overlooked city center, the flat boasted a large terrace and afforded a spectacular view of the city. It was situated at the heart of the community Kobylisy and the subway station and tram stops there granted convenient access to the entirety of Prague. However, the entirety of Prague is a very large area and I was intimidated by the task of navigating it alone. Whether she meant to or not, my host aunt dispelled this fear in the most unorthodox of ways. She sent her kids to show me around.</p>",
            "Text": "<p>We arrived in Prague on the doorstep of my host uncle&rsquo;s apartment. Built into a hillside which overlooked city center, the flat boasted a large terrace and afforded a spectacular view of the city. It was situated at the heart of the community Kobylisy and the subway station and tram stops there granted convenient access to the entirety of Prague. However, the entirety of Prague is a very large area and I was intimidated by the task of navigating it alone. Whether she meant to or not, my host aunt dispelled this fear in the most unorthodox of ways. She sent her kids to show me around.</p><p>I don&rsquo;t mean we walked around the neighborhood and back. No, just before dusk on that first night, my eleven and eight year-old host cousins, young brother and I were sent to buy bread from a nearby bakery and to visit a park a quarter of the way across the city! The boys took me to the metro station where the bakery was located, showed me how to purchase tickets for the subway, bus and tram systems, then dragged me back onto the streets above. We caught a tram and rode it for several minutes until we reached a large park, which brimmed with streams and lakes. The temperature in Prague was frigidly below average and these small bodies of water were largely frozen over.</p><p>My three charges ran and slid and jumped carelessly all over the ice. I remember what it was like to be a young boy, so&nbsp;I could understand and didn&rsquo;t want to spoil their fun. Yet, as the present adult, I suffered a small heart-attack every time the ice cracked. I was relieved when we finally returned to the tram. What a first impression that would have been! To step through the front door, carrying the half frozen form of one of my host cousins.</p><p>My host family spent that night in Prague, but departed the next morning for Slovakia. That left me in one of Europe&rsquo;s greatest cities for the next seven days. What an opportunity&hellip; I simply had to see it all!</p><p>On the subway the next morning, headed for the historic Wenceslas Square, my host aunt explained how to get around the city, what sites to see, what to do in case of an emergency and so on. When we reached the square, her lecture shifted from my well-being to the history of Prague. She recalled when her 12 year-old self had sat on her father&rsquo;s shoulders, amid tens of thousands of then Czechoslovak citizens all jingling their keys and demanding the end of communism. As a result, just weeks later, the journalist, playwright and activist Vaclav Havel (above) would be elected president on December 29th, 1989 and begin Czechoslovakia&rsquo;s first real foray into democratic government since the Nazis invaded in the 1930s.&nbsp;</p><p>Exiting Wenceslas Square, my aunt showed me to the tower which marked the entrance into Prague&rsquo;s old town then left me to explore on my own. I spent the rest of the day wandering where I could, from grand squares to empty side streets. I have a method when it comes to traversing old European cities. Get lost. Just keep turning until you no longer have any way of orienting yourself. Then sit down at a cafe and enjoy the atmosphere. It is when you are lost that you find the places where they speak to you in the native language first and where you can watch local people go about their daily lives.</p><p>Large cities like Prague are designed to funnel tourists down the same avenues, to the same restaurants, shops and sites. These aren&rsquo;t the places you find local spirit. Most of the people aren&rsquo;t Czech and most of the things you will encounter are Americanized, so that we [Americans, as well as Canadians, Brits etc.] feel more at home while we travel, as odd as that might seem.</p><p>I managed to get lost wonderfully that first day in the city. After visiting Prague castle, I decided to return to Charles&rsquo; Bridge a different way than I had come. Climbing down the opposite side of the hill, I briefly passed through what looked to be a small business or government district of sorts. I walked a bit farther and the buildings suddenly parted onto a beautiful park&mdash;or what I assumed would be beautiful in the spring and summer months. This space was filled with hundreds of dormant trees, all laid out in the tell-tale array of an orchard. I walked beneath the barren boughs, to the opposite end of the park, wondering if there was another exit or if I would have to return to where I started.</p><p>As it happened, I discovered one of the most charming roads I have yet encountered in Europe. The winding cobblestone street snaked up the hills, lined first by crumbling brick and plaster walls the color of aged parchment, then by various classical homes and buildings behind the barriers. I mourn that my camera was not ready to catch the moment, for, as I paced down this enchanting boulevard, a nun stepped out of a wooden door set into the wall and glanced up at me. With the cityscape of Prague in the background, this would have made for a stunning shot. Alas, she turned and began briskly jogging down the road, black garments fluttering through the cold air behind her.</p><p>Still following this path, I encountered more and more people, though the majority remained local. I ended up in an area dominated by multiple foreign embassies. I walked past waving flags from across the world: Italy, Germany, Sweden and numerous others I couldn&rsquo;t exactly place. The final one that I passed just happened to be the US embassy&mdash;immediately beyond it, the roads filled with tourists again&hellip; go figure.</p><p>That just about concludes my first day in Prague. It is a wonderful city and I hope that I get to return in fairer weather. There are many other destinations across Europe that I desire to visit, but I don&rsquo;t know if I can return to the USA without seeing the &ldquo;Golden City of a Hundred Spires&rdquo; once more.</p><p>Signed,<br>Andrew</p>"
        },
        {
            "cityName": "The Havranok Ruins",
            "country": "Slovakia",
            "imageURL": "../img/havranok.jpg",
            "date": "04.03.2018",
            "lat": "49.1048792",
            "lng": "19.481891",
            "lede": "<p>Partially restored since their discovery several decades ago, the ruins of Havr&aacute;nok overlook a vast swath of land. The Western, Low, and a bit of the High Tatras can all be seen from its hilltop perch. Ascending the steep grade, the first sight which greets you is a quaint wooden hut and the smithy beside it. Representative of the Iron Age, but merely a recent reconstruction, the cottage is a fascinating example of life in Europe at that time, but lacks a certain ancient aura. Yet, that very primeval feeling seems to radiate from the slopes above.&nbsp;</p>",
            "Text": "<p>Partially restored since their discovery several decades ago, the ruins of Havr&aacute;nok overlook a vast swath of land. The Western, Low, and a bit of the High Tatras can all be seen from its hilltop perch. Ascending the steep grade, the first sight which greets you is a quaint wooden hut and the smithy beside it. Representative of the Iron Age, but merely a recent reconstruction, the cottage is a fascinating example of life in Europe at that time, but lacks a certain ancient aura. Yet, that very primeval feeling seems to radiate from the slopes above.&nbsp;</p><p>It is hard to discern from the cottage if the stone barrier standing atop the next hill is natural, modern or Celtic in origin. After cresting the ascent, however, it becomes apparent that you are staring at a wall older than most of Europe. Moss and roots strangle its stones and modern supports are needed to keep it up right, but this fossil is strong. It has witnessed more history than most of our modern creations can ever hope to.</p><p>Evidence of Celtic settlement was uncovered during the construction of the Liptovsk&aacute; Mara</span> reservoir during the 1970s. Up until the late 800s&mdash;with the arrival of missionary Saints Cyril and Methodius&mdash;all tribes (Celtic, Slavic or otherwise) in Eastern and Central Europe had been pagan and archaeologic studies have revealed that Havr&aacute;nok was an important religious center for the region. Accordingly, an uncovered sacrifice pit sits at the heart of the complex surrounded by (modern reconstructions of) pillars covered in runes, patterns and the bones of animal victims.</p><p>I anticipate returning to this site in the summer. Then, a full living-history museum will be functioning, with actors portraying Celtic inhabitants and showing visitors how Europe&rsquo;s pagan tribes once lived.</p><p>Signed,<br>Andrew</p>"
        },
        {
            "cityName": "Pribylina",
            "country": "Slovakia",
            "imageURL": "../img/pribylina.jpg",
            "date": "04.21.2018",
            "lat": "49.105694",
            "lng": "19.8062004",
            "lede": "<p>Tucked into the hills of the Liptov region, the open-air museum of Pribylina offers a glimpse into what the lives of the majority of Slovaks looked like up until the early-twentieth century. This agrarian lifestyle still lives in the memory of many people here. My host-father, only in his forties, remembers childhood visits with his grandparents who lived in an old cottage and took him on rides in their horse-drawn sledge. They had spent their lives laboring alongside their village, sustaining each other by working the earth. It amazes me to think that people just a couple generations past had life experiences more similar to people 500 or more years ago than to today&rsquo;s world.&nbsp;</p>",
            "Text": "<p>Tucked into the hills of the Liptov region, the open-air museum of Pribylina offers a glimpse into what the lives of the majority of Slovaks looked like up until the early-twentieth century. This agrarian lifestyle still lives in the memory of many people here. My host-father, only in his forties, remembers childhood visits with his grandparents who lived in an old cottage and took him on rides in their horse-drawn sledge. They had spent their lives laboring alongside their village, sustaining each other by working the earth. It amazes me to think that people just a couple generations past had life experiences more similar to people 500 or more years ago than to today&rsquo;s world.&nbsp;</p><p>Pribylina is unique. Uncharacteristic for its size, the village boasts both an impressively large stone church and an imposing manor house. The latter was originally inhabited by the Paris family in the 1300s (no seeming relation to the city), but saw multiple Hungarian owners through the centuries. It served as the luxury residence for yeomen, the owners of a swath of land and all the agriculture and other production which took place on it. From this small estate, the Paris family and their successors directed and profited from the labor of Pribylina&rsquo;s residents. &nbsp;Their influence stretched even further, however, as the Paris family worked with the lord of the Liptov region, acting as the reigning secular force in the area.</p><p>Pribylina&rsquo;s historic importance to the region extinguishes any wonder at why it was chosen to become a site of cultural preservation. When the Liptovsk&aacute; Mara dam was completed in the 1975, a number of villages were inundated under rising waters. Residents of the Liptov region concerned with protecting their heritage moved important architectural monuments to other locations in the region, like the church of Sv&auml;t&yacute; Kr&iacute;ž, which I wrote about in a previous post. Pribylina was chosen to be the new home for several of the homes and public buildings under protection.</p><p>In addition, the open-air museum at Pribylina features a collection from Tatra&rsquo;s first railway system. The section of rail around the village is no longer used, but it was once a very important one for industry and transport in the Western Tatras. I visited the village and the train museum with my host family and my most brother and his friend insisted I take photos of them with the trains.</p><p>Pribylina is the opposite of Vlkolinec, another village I recently visited. The latter is wonderful for the fact that, despite its age, it has been continually inhabited and still serves its residents well today. Pribylina, on the other hand, is a relic from the past, frozen in a century long ago. The magic of its dirt roads, flanked on either side by clean, white-walled cottages, left me dreaming of the quaint provincial life. The museum pulls no punches in letting visitors know just how hard an such an existence could be, but it was impossible for me to look at the homes and the surrounding countryside and not long in some part for that simple life.</p><p>Signed,<br>Andrew</p>"
        },
        {
            "cityName": "Slovenský Raj",
            "country": "Slovakia",
            "imageURL": "../img/raj.jpg",
            "date": "04.18.2018",
            "lat": "48.9083899",
            "lng": "20.3863871",
            "lede": "<p>Waterfalls are abundant in the Blue Ridge Mountains of my home, but our paths force hikers on long detours through the forests to circumnavigate them, keeping everyone a safe distance from the potentially treacherous cliffs. This safety precaution is likely wise, yet, it is completely disregarded here in Slovensk&yacute; raj. Rickety metal ladders and rotting wooden bridges take visitors along the most direct path&mdash;straight up the falls!</p>",
            "Text": "<p>Waterfalls are abundant in the Blue Ridge Mountains of my home, but our paths force hikers on long detours through the forests to circumnavigate them, keeping everyone a safe distance from the potentially treacherous cliffs. This safety precaution is likely wise, yet, it is completely disregarded here in Slovensk&yacute; raj. Rickety metal ladders and rotting wooden bridges take visitors along the most direct path&mdash;straight up the falls!</p><p>The trail&rsquo;s infrastructure, which is truly in better repair than I make it sound, conveys hundreds of hikers every fair-weathered day. My host family and I visited just a couple weeks ago, right after the year&rsquo;s first heatwave had begun to melt the snow-capped mountains. The river which cascades through Slovensk&yacute; raj was absolutely gorged on this runoff and I found it impossible to navigate the trail without soaking my shoes.</p><p>While scaling the numerous steel ladders and catwalks, I marveled at the sheer presence the waterfalls exuded. Easily comprehensible was the fact that the rush of water beneath my feet had carved the very gorge around me across the span of thousands of years. The frothing flow jetted over impossibly smooth stones and down twisting ravines, at the end of which it would suddenly free-fall, descending dozens of feet to the pools below.</p><p>The High Tatras seem to be sleeping giants; majestic, but remote and cold. In contrast, Slovensk&yacute; raj is a wild animal. Alive in every corner, it lets its waters roar so everyone knows its might.</p><p>Signed,<br>Andrew</p>"
        },
        {
            "cityName": "Červený Kláštor",
            "country": "Slovakia",
            "imageURL": "../img/klastor.jpg",
            "date": "05.06.2018",
            "lat": "49.3917746",
            "lng": "20.4053151",
            "lede": "<p>Just setting foot within the first courtyard of Červen&yacute; Kl&aacute;&scaron;tor (the Red Monastery) it is evident why this place inspired legends. The orderly cobblestone underfoot and the warm hues of the tiled roofs and crumbling walls gave the impression of sanctuary against the wild green chaos around. Even though many people sat in the first courtyard with drinks outside an on-site pub, the monastery commanded a certain silence, a permanent sort of peace.&nbsp;</p>",
            "Text": "<p>Just setting foot within the first courtyard of Červen&yacute; Kl&aacute;&scaron;tor (the Red Monastery) it is evident why this place inspired legends. The orderly cobblestone underfoot and the warm hues of the tiled roofs and crumbling walls gave the impression of sanctuary against the wild green chaos around. Even though many people sat in the first courtyard with drinks outside an on-site pub, the monastery commanded a certain silence, a permanent sort of peace.&nbsp;</p><p>The beginnings of what stands today were erected in 1320, though it has only seen a religious use for about, cumulatively, 300 years since then. The first monks to worship within its halls were the Carthusians who built it. However, their order faced troubles after the Protestant reformation and the monastery was closed in 1567, purchased by a secular nobleman.&nbsp;</p><p>Religious life returned to Červen&yacute; Kl&aacute;&scaron;tor in 1711 when the Camaldulian order of monks took up residence. They were a very strict order, living reclusively beneath vows of silence and heavy, self-imposed workloads. The Camaldulians at Červen&yacute; Kl&aacute;&scaron;tor were healers and gardeners, growing herbs to make medicine. The most famous of the monastery&rsquo;s residents earned his reputation through regionally renowned healing.</p><p>Father Cyprian&rsquo;s most important work was his 1766 <em>Herbarium</em> containing 283 herbs from the Pieniny and Tatra Regions. Yet, legends arose abound him for more than just his study as a physician and botanist. Cyprian also kept the most well known and trusted pharmacy in all of Austro-Hungary. He created household items for the monastery and surrounding villages, like candles and mirrors, as well as practiced alchemy. His seeming endless knowledge impressed the locals and was passed down to generations well after his death. Legends grew about &ldquo;Flying Cyprian&rdquo;, stating the monk had donned a glider of his own creation and flew from the highest peak of the Three Kings to the Tatra mountains beyond.</p><p>Červen&yacute; Kl&aacute;&scaron;tor is the first monastery that I have visited. Frankly, it impressed me more than any cathedral I have seen. There is something honest in the modest architecture and barren halls. The location itself seemed to express how unnecessary the grand superficiality of more prominent churches is compared to a labor of generations of monks which built it to be a functional and useful place of worship. This monastery helped people through healing and bestowing useful goods. To me that is a hundred times greater than any ornate, towering steeples.</p><p>Signed,<br>Andrew</p>"
        },
        {
            "cityName": "Auschwitz",
            "country": "Poland",
            "imageURL": "../img/auschwitz.jpg",
            "date": "11.08.2017",
            "lat": "50.0274106",
            "lng": "19.2019829",
            "lede": "<p>It wouldn&rsquo;t have surprised me if the looming clouds and the sprinkling rain were ever present above the dreary rust-colored buildings, the very Earth trying to block out the place and wash clean its sins. Great and horrible monuments alike survive amid Mankind&rsquo;s tumbling and wanton sense of progress. We, as humans, naturally feel the necessity to preserve what we are proud of as well as that which demonstrates our ever-present and unforgettable evils.&nbsp;</p>",
            "Text": "<p>It wouldn&rsquo;t have surprised me if the looming clouds and the sprinkling rain were ever present above the dreary rust-colored buildings, the very Earth trying to block out the place and wash clean its sins. Great and horrible monuments alike survive amid Mankind&rsquo;s tumbling and wanton sense of progress. We, as humans, naturally feel the necessity to preserve what we are proud of as well as that which demonstrates our ever-present and unforgettable evils.&nbsp;</p><p>If walls could talk, I doubt these would dare speak. Between them, malnourished men and women daily rose from flea-infested straw beds on cold cement floors and trudged out to work. Each hour their bodies subsiding less on the moldy scraps of bread and watery soup they&rsquo;d been fed, than on the last healthy flesh and fat to cover their bones. In ill-fitting wooden shoes the bony figures marched to their daily tasks, or perhaps to the showers. They pass a gate that leads to a courtyard where men who couldn&rsquo;t be kept for the gas chambers were executed, their wives across the camp praying that the echoing shots were not piercing their husbands.&nbsp;</p><p>The horrors of Auschwitz moved me deeply, and at moments filled me with despair, but generally my empathy felt rather dull. I tear up at a sad love song or sentimental movie, but at a place of genocide my eyes remained dry. I felt a certain amount of guilt at this. Was I being insensitive? No, I know myself better than that. To me Auschwitz&rsquo;s history was basely appalling. So much so, that my heart must&rsquo;ve ducked into a shell and refused to feel a thing. For if it didn&rsquo;t it would have crumble at the horrors that surrounded me.&nbsp;</p><p>Of the dark things I saw, the worst sat among the material evidence of the Nazis crimes. I recall long ago hearing about the display, but I had forgotten it existed even as I walked into the room. Within the dim chamber, behind glass panels, literal tons of human hair were piled, entangled in knotted mounds. Most of it is likely the last physical remains of the bodies&rsquo; to which it had once belonged. As if this wasn&rsquo;t crime enough, plaques told that as the war drew to a close and the Nazis ran low on supplies they began to use the hair of their deceased captives to make textiles for their war effort. One such coarse roll sat on display. How many people had used the fabric? Did any of them know? What cruelty, of course in the murder, but also making innocent and ignorant people a part of the horror.&nbsp;</p><p>The German citizens had little idea of the full extent of the Nazi&rsquo;s actions. They were aware that their Jewish neighbors were being taken to work camps and many of them, under the influence of Hitler&rsquo;s charisma, supported this deportation. However, the genocide and abuse which took place would have horrified the German people then as it does us now. Therefore, the Nazi&rsquo;s had to maintain the illusion that the Jewish folk and other captives were working in factories and producing goods for German use. In this was their most clever and resourceful lie. The men, women and children who were gassed or worked at Auschwitz had their possessions seized and then sold back to German citizens as the goods which the Jews were producing for them</p><p>I am so grateful that I had the opportunity to visit such a significant place. In a world still plagued by the same senseless hate that instigated this tragedy, it is important for all to be made painfully aware of the mistakes Mankind has made. The EU agrees with this sentiment, encouraging schools across Europe to take their students to visit the monument. The atrocities committed at Auschwitz can never be atoned for, but perhaps through education its memory can be preserved and used to guide our futures away from the twisted values that plagued the past.</p><p>Signed,</p><p>Andrew</p>"
        },
        {
            "cityName": "Olomouc",
            "country": "Czechia",
            "imageURL": "../img/olomouc.jpg",
            "date": "01.31.2018",
            "lat": "49.593778",
            "lng": "17.2508787",
            "lede": "<p>The sleepy silence of 3:00 AM and I have become more familiar than I had expected this January. Three consecutive Mondays began with early morning departures and sleep deprived car rides. The first two of these sent me to Olomouc in the Czech Republic. I function poorly on anything less than seven hours of sleep, and as I never failed to stay up late preparing for these trips, they certainly took their toll. Nevertheless, adventure called! And I am always happy to receive it! Spurred by an energy unexpected from just a few hours of sleep, I dressed, ate whatever was on hand, packed my camera and hopped in the car beside my host father. It seems that adventure&rsquo;s call is a transient whim, though, as before long both trips saw my face buried into the car seat, half-conscious. </p>",
            "Text": "<p>The sleepy silence of 3:00 AM and I have become more familiar than I had expected this January. Three consecutive Mondays began with early morning departures and sleep deprived car rides. The first two of these sent me to Olomouc in the Czech Republic. I function poorly on anything less than seven hours of sleep, and as I never failed to stay up late preparing for these trips, they certainly took their toll. Nevertheless, adventure called! And I am always happy to receive it! Spurred by an energy unexpected from just a few hours of sleep, I dressed, ate whatever was on hand, packed my camera and hopped in the car beside my host father. It seems that adventure&rsquo;s call is a transient whim, though, as before long both trips saw my face buried into the car seat, half-conscious.&nbsp;</p><p>Patrik, my host father, travels with work constantly. Mostly across Slovakia, the Czech Republic and Germany. I&rsquo;m invited to accompany him whenever I wish! So far, I&rsquo;ve gone to a couple different locations in the lower mountains of Slovakia and twice to the city of Olomouc!&nbsp;</p><p>Olomouc is a university town, but it takes that moniker to an entirely different level than we are familiar with in the US or elsewhere abroad. Palack&yacute; University, the first founded in Moravia and second oldest in all the Czech Republic, was set up by Jesuit monks in the late 1500s. Their end game was to reestablish Roman Catholicism as the dominate religion in then mostly protestant Czech lands. Regardless of their motivations, the Jesuit universities were a success and had a tremendous effect on the history of the city. In 1848, the faculty and students in Olomouc fought for Czech national identity against the Hapsburg Empire. The movement&rsquo;s ultimate failure resulted in the closure of the university for a hundred years. It was revived, however, in the 1950s under the name Palack&yacute; University of Olomouc as it is today.<br><br>The students seemingly run the city! A quarter of Olomouc&rsquo;s 100 thousand people are actively enrolled. Everything from the city&rsquo;s working hours to tram schedule are based around student activities.<br><br>The number of international students is astounding! I heard a motley of different languages over my two trips there and saw a large number of people of non-European ethnicity. I am aware that this cosmopolitan composition is the norm for most large European cities, yet, it is quite a uncommon sight for my eyes. Slovakia isn&rsquo;t the a very diverse place. This fact has both to do with its relative lack of renown&mdash;and therefore influx of people&mdash;and a tad with the a majority of the population&rsquo;s&hellip; predisposition. (A topic for another time&hellip; or to be avoided entirely. We will see.)<br><br>Returning to the streets of Olomouc! Among the most attention grabbing things to adorn the city streets are the seven city fountains. Each of these constructions has a unique history and meaning in local lore.</p><p>Listed in no particular order, the first and most grandiose of these fountains is the Caesar Fountain. The man himself gazes from a fearsome steed towards a hill where Roman legions are believed to have once set up an encampment, therefore establishing the foundation upon which Olomouc would grow. The two bearded men below are river gods, representing the Morava and Danube Rivers. They each hold shields emblazoned with the crests that describe the loyalty of Olomouc and Moravia to the Czech ruling family. In 1725, this structure was completed as designed by the young sculptor J.J. Schauberger.</p><p>Surrounded by four horses, classically affiliated with the ocean in both Greek and Roman mythology, the Neptune Fountain features the god of the ocean violently plunging his trident towards the earth beneath him. The sculptor M. Mandik is responsible for the creation of this fountain in 1683, although the basin of the fountain was created by the aforementioned Olomouc stonemason V. Sch&uuml;ller.</p><p>The<strong>&nbsp;Mercury Fountain&nbsp;</strong>sits on a busy intersection between multiple tram stops and a shopping center. The atmosphere of the area is rather appropriate, though. The Roman deity of travel and commerce&mdash;among other things&mdash;Mercury couldn&rsquo;t seemingly be situated in any better a place.&nbsp;</p><p>The <strong>Tritons Fountain</strong> is crowed with a boy holding a couple sea dogs on chains. Below him play representations of the mischievous Roman sea deities, Tritons. This fountain was designed by the Italian sculptor L. Bernini in 1709.</p><p>When first completed in 1707, the <strong>Jupiter Fountain</strong> in fact depicted St. Florian, who is widely venerated throughout Central Europe. However, a mere twenty years later, he was replaced by a representation of the highest of Roman gods, Jupiter. He strikes a mighty form, wielding a bundle of lightning bolts in one hand while the other rests on his hip.&nbsp;</p><p> Unaware that I would be writing such a thorough review of Olomouc&rsquo;s fountains, I actually failed to acquire of photo the <strong>Hercules Fountain</strong>. However, you can see the landmark above in a photo from the Olomouc Tourist website (visitolomouc.cz). In this work, Hercules brings his club down against the hydra he faced in legend. On his left side is a checkered eagle, the symbol of Olomouc.</p><p>The<strong>Arion Fountain</strong> stands out among the others for both its composition and age. It is the city&rsquo;s newest by over 200 years! In 1989, the city council of Olomouc wished to again erect a fountain that reflects the long history of mythology among city art. They conscripted the help of local Olomouc sculptor Ivan Theimer and the Tuscan Architect Angela Chiantelli. They devised a fountain centered around the story of Arion. In classical legend, Arion was a masterful musician. He won a musical competition on the island of Sicily and received a great monetary reward. On his return to trip to Greece, the sailors that manned the boat he traveled on plotted to kill him and steal his wealth. When confronted, Arion requested that he be allowed to perform one last song before his death. This was granted and, before he could be thrown overboard, his lovely melody attracted a pod of dolphins. One of the creatures saved him after he was flung into the sea. Later, the god Apollo would forever memorialize Arion and his dolphin in the constellation <em>Delphinus.&nbsp;</em></p><hr><p>Olomouc is a city at its best in Spring. Though I have not seen it then, over my visits I could imagine the potential of the extensive networks of dormant parks and gardens. All were still a pleasant walk even in their lack of color, though I could not help but see just how greatly improved the city would be in a more verdant month. A few goods came of Winter&rsquo;s desolation, however.</p><p>The Botanical Garden Rozarium runs parallel to the public park opposite of Mlynsky Stream. As the rest of the city, its soil was empty and dull brownish-grey. The gardens themselves are closed to the public in the winter, though that didn&rsquo;t prevent me from entering an ajar back gate (which I was then unaware was not a legitimate entrance). I wandered the empty paths for some time, wondering what the flora must look like in bloom and enjoying the beauty of the place with no one to disturb my meditations, before realizing that I had somehow stumbled upon the only open entrance and the rest were sealed. I retraced my steps and came back out into the complex which had brought me there, the Museum of the Olomouc Fortress.</p><p>Once overgrown and in ruins, the now pristinely authentic wooden gated mounted in high stone walls seized my romantic spirit and dragged me inside the first time I laid eyes on it. Though I could not fully decipher the Czech on the educational signs scattered about, it appeared that the whole property was recently restored to peak condition and is now used as an events center and museum. The place was relatively empty despite being open to the public all year! A fortunate fact as I ended up with some free time before I needed to meet my host father on our second outing to Olomouc. After many hours of continuous bustle, I desired some respite from the noise and proximity in the city. I found it at the auditorium at the Fort. Built into a concave section of the wall, the cement seating provided a comfortable place to sit and rest while I waited. The sun had just escaped the cloudy prison it spent the morning in and the day became rather pleasant. I sat and after a time began to toy around with my camera, mounting it on a tabletop tripod and snapping a few shots of myself.</p><p>Describing the entire city in the manner I have been writing above&mdash;while certainly deserved by the historic and beautiful city&mdash;would take much longer than than one post could support. Therefore, I do believe I will have to return to the topic some other time. For now, you can view a few extra photos from my trips below.<br><br>Thank you for taking the time to read.<br><br>Signed,<br><br>Andrew Dundas</p>"
        },
        {
            "cityName": "Viennese Christmas Markets",
            "country": "Austria",
            "imageURL": "../img/vienna.jpg",
            "date": "12.18.2017",
            "lat": "48.2081743",
            "lng": "16.3738189",
            "lede": "<p>The size of the Viennese Christmas markets is not what makes them exceptional. If that was so, any shopping center with a half-a-theme could compete. It’s the atmosphere and the quality of the goods that inspired global admiration for this seasonal Austrian wonder.</p>",
            "Text": "<p>The size of the Viennese Christmas markets is not what makes them exceptional. If that was so, any shopping center with a half-a-theme could compete. It&rsquo;s the atmosphere and the quality of the goods that inspired global admiration for this seasonal Austrian wonder.</p><p>My first glimpse of this occurred early in the morning, in front of Sch&ouml;nbrunn Palace. The stalls were just opening and I was astounded to see not cheaply-made, imported products or plastic playthings promoting media, but honest wood and metal toys like the ones in movies, story books, and old cartoons. Many of the items were authentically Austrian and handmade. Candles from local beeswax, decorations by Viennese craftspeople, and food from village bakeries.</p><p>Beyond these items, the booth themselves were works of Christmas art. I never thought the sheer amount of holiday atmosphere present in my favorite movies could truly come to life. Yet, here, especially after dark, the markets were alive with glittering ornaments, ethereal lights, and the deep warm hues of the season. One could imagine they stood just outside of Santa&rsquo;s workshop in a crowd of busy tinkerers, instead of in one of Europe&rsquo;s great cities amid tourists and shopkeepers.</p><p>On Heldenplatz&mdash;the Heroes&rsquo; Square I mentioned in a previous post&mdash;Rotary pointed us towards the nearest and largest of the markets. Alex, Anthony&mdash;both from California&mdash;and I wandered the markets together. We joked that we were the Triple A&rsquo;s or The A-Team, and developed a system to stick together amid the bustle. Alex, who stands a head and a half or more shorter than Anthony and I, could easily be lost in the crowds swarming the markets. Each time we were separated we would toss up our hands, fingers fanned out wide, to signal the others. Admittedly, even with arms raised, Alex was still shorter than most of the towering Germans and Slavs (sorry buddy), but we managed to stay together.</p><p>We each left the Viennese markets, purchases in hand, amazed at the sights, and chilled to the bone. Alex got some of the best jam I&rsquo;ve ever tasted and I&hellip; well, I can&rsquo;t quite say lest my sister&rsquo;s should read this prior to receiving their Christmas gifts.</p><p>Signed,</p><p>Andrew</p>"
        },
        {
            "cityName": "Bratislava",
            "country": "Slovakia",
            "imageURL": "../img/bratislava.jpg",
            "date": "07.02.2018",
            "lat": "48.1485965",
            "lng": "17.1077478",
            "lede": "<p>In the previous post, I wrote of the outing I took to Devin Castle with my Slovak friend, Milan. Those ruins were just one part of our larger trip to Bratislava. We toured much of the city and I learned a lot that I hadn&rsquo;t over my two previous visits to the city.</p>",
            "Text": "<p>In the previous post, I wrote of the outing I took to Devin Castle with my Slovak friend, Milan. Those ruins were just one part of our larger trip to Bratislava. We toured much of the city and I learned a lot that I hadn&rsquo;t over my two previous visits to the city.</p><h4>The Pyramid</h4><p>One of our first stops was the Pyramid, among Bratislava&rsquo;s most iconic structures. In 1967, a team of Slovak architects began to design the ambitious project. The Pyramid is home to the public broadcasting service of Slovakia, RTVS (Radio and Television &ndash; Slovakia) and Milan knew it well because his father works for them as a journalist. Despite having been included on a list of the world&rsquo;s 30 ugliest buildings, designers from the country defend its ingenuity to this day. &nbsp;I, for one, happen to quite like the building. It isn&rsquo;t exactly attractive, but it is extremely intriguing and rather impressive.</p><h4>The Old Bridge</h4><p>Contrary to its name, the Old Bridge is well maintained and fairly modern looking. It boasts lovely views of the city and is likely the best walk over the Danube in all of Slovakia.</p><h4>The Saturday Market</h4><p>I had some free time to wander the city when Milan met with some family who happened to be in Bratislava at the same time as us. I saw the old town&mdash;as I always do&mdash;and then wandered down a street he&rsquo;d recommend for having good shopping. I eventually began to explore new avenues, though, and stumbled across a really cool event.</p><p>In an grandly restored, old, industrial building, I found bustling crowds around market stalls selling regional foods, spices, clothing, wine, honey and everything else you could imagine. The Saturday farmer&rsquo;s market was in full swing, and on one of the busiest streets in the city! On the second level, a flea market peddled books and old trinkets, while opposite it a vegan restaurant catered to hipster clients and actors performed an educational program for children. All of it was so refreshingly modern. I adore living in Poprad for the nature that is there, but I truly miss such progressive places and, in Slovakia, you can only really find such things in Bratislava.</p><h4>Bratislava Castle</h4><p>I have visited this castle numerous times, though I am embarrassed to say, I never really knew there was much to see inside. The museum of Bratislava Castle is an amazing experience. The exhibits take you through Slovak history, from the Stone Age to the fall of communism and Velvet Divorce which birthed a newly independent Slovak state. The most interesting exhibit for me portrayed Czechoslovakia in the roaring twenties and thirties. Just like the USA, this was a golden era for the nation. I was stunned when I walked into the room. The walls were covered in posters and signs from those decades, all in that iconic advertising style which I had assumed was uniquely American. Slovakia, which has for decades lagged just behind the rest of the developed world (a result of Soviet communism) was once a rival to even the economic powerhouse of the USA. Unfortunately, I failed to take any photos but I will insert some examples of the style from America and a few of the Czechoslovakia advertisements I could find online.</p><p>Just before we left the castle, we climbed up the largest tower and gazed out at the city beyond. The top level was sweltering, but the view was worth it. Bratislava is a small city, but that produces its own kind of charm. You can see the age of the streets change as they radiate outwards from the old town. Medieval buildings slide into the Renaissance, then Industrial era and Communist architecture, finally reaching modern development on the outskirts.</p><p>Bratislava is a beautiful city and my final trip there was certainly the best. I owe thanks for that to Milan for showing me around the city and convincing me to go that one last time.</p><p>Signed,<br>Andrew</p>"
        },
        {
            "cityName": "Jasná Ski Resort",
            "country": "Slovakia",
            "imageURL": "../img/jasna.jpg",
            "date": "02.19.2018",
            "lat": "48.967277",
            "lng": "19.585192",
            "lede": "<p>My breath wet the mask through which it passed, quickly freezing and collecting flakes from the densely falling snow, glued even harder by the rushing air of my descents. Even while my face numbed against these cold gusts, the inside of my coat heated up like a furnace due to the exertion of moving around in heavy gear. This unpleasantness, however, existed only as long as the lines for the lifts; all discomfort faded from my senses as I plummeted from the crest of each slope, cutting through the powder and fighting to maintain control against the icy and uneven terrain. In their stead, these annoyances were replaced by an adrenaline fed euphoria, unattainable by the power of our bodies alone. Skiing is addictive because it makes us feel like super-humans, accomplishing feats of speed and control without the distancing aid of machinery. Many extreme sports may boast to instill similar feelings, but not with the same safe accessibility that skiing can.</p>",
            "Text": "<p>My breath wet the mask through which it passed, quickly freezing and collecting flakes from the densely falling snow, glued even harder by the rushing air of my descents. Even while my face numbed against these cold gusts, the inside of my coat heated up like a furnace due to the exertion of moving around in heavy gear. This unpleasantness, however, existed only as long as the lines for the lifts; all discomfort faded from my senses as I plummeted from the crest of each slope, cutting through the powder and fighting to maintain control against the icy and uneven terrain. In their stead, these annoyances were replaced by an adrenaline fed euphoria, unattainable by the power of our bodies alone. Skiing is addictive because it makes us feel like super-humans, accomplishing feats of speed and control without the distancing aid of machinery. Many extreme sports may boast to instill similar feelings, but not with the same safe accessibility that skiing can.</p><p>Such an overly philosophic take on this common sport requires an excess of time over which to reflect&mdash;and time I had. I have just spent the entirety of the past week at the largest ski resort in Slovakia, Jasn&aacute;, which translates to &ldquo;clear&rdquo; or &ldquo;sunny&rdquo;. Well, that adjective&hellip; it was not. Snow fell heavily for days on the dozens of slopes crisscrossing the powder-laden conifers of the Low Tatras, just above the city of Liptovsk&yacute; Mikul&aacute;&scaron;. This made for lovely skiing conditions and aided my education to no end, yet I couldn&rsquo;t help but lament that the weather was too harsh to expose my camera to. I clung to hope, though, that one day&mdash;at the very least!&mdash;would allow me to capture the beauty of this mountain resort. The unobstructed view of one early sunrise through the window of my room foretold of such a days arrival.</p><p>Awaking that Thursday morning, turquoise light filtered in and touched my sight the first time in what felt like weeks. Downstairs, I threw open the dining room curtains, where all of us students met for breakfast, and gazed upon the monolith of Chopok, the resorts highest peak. A few sparse clouds hovered around it, but otherwise the sky was perfectly clear. We all gathered our gear&mdash;and I my camera&mdash;for a morning outing to the mountaintop. The maze of interconnecting lifts slowly, but eventually, brought my group and I to our destination, where a sea of clouds made it seem like snow had buried all but the highest of the surrounding mountains.</p><p>The alpine air atop Chopok was frigid and once we left, I packed my camera again and stuffed my hands deep into the pockets of my coat. The rest of the day was spent skiing as usual, though I captured this shot of a man going down a trick slope next to the Slovak Olympic banner over lunch.</p><p>Otherwise, out evenings were filled with movies, sledding and one night&rsquo;s Carnaval party for the Brazilians. I also spent as much of my time as I could keeping up with the Olympics! I really don&rsquo;t want to miss this opportunity which only comes every two years! I must say, though, watching so many pro skiers may have encouraged me to ski a bit faster and more recklessly than advisable. Though, only twice did I have falls of any consequence. The first twisted my knee, pain which only bugged me the afternoon of the final day, and the second saw me swerve to avoid hitting a girl in front of me, break free of my skis and slide with some speed across the powder on my back. A dome of flying snow was created as I plowed ever deeper into the ground, yet I found this scene to be pretty and the utter lack of any sort of pain resulted in me actually quite enjoying the experience. Though I do wonder what the woman who helped me collect my skis thought of the chuckling snow-covered boy who had wiped out just in front of her.</p><p>All around, ski week was a wonderful trip and I will long remember traversing the long, wooded trails of the resort and the quality time I was able to spend with my friends. I look forward now to Euro-tour, when I will see everyone once more.</p><p>Signed,<br/>Andrew</p>"
        },
        {
            "cityName": "Piešťany",
            "country": "Slovakia",
            "imageURL": "../img/piestany.jpg",
            "date": "02.04.2018",
            "lat": "48.588042",
            "lng": "17.840829",
            "lede": "<p>As noted in the previous post, I have spent the past three Mondays traveling. The first two trips were to Olomouc in the Czech republic, but the third took me to the small, but renowned, city of Pie&scaron;ťany. Less than an hour from Slovakia&rsquo;s capital, Bratislava, Pie&scaron;ťany would stand out little in the populated region of western Slovakia were it not for its long history as a place of healing.</p>",
            "Text": "<p>As noted in the previous post, I have spent the past three Mondays traveling. The first two trips were to Olomouc in the Czech republic, but the third took me to the small, but renowned, city of Pie&scaron;ťany. Less than an hour from Slovakia&rsquo;s capital, Bratislava, Pie&scaron;ťany would stand out little in the populated region of western Slovakia were it not for its long history as a place of healing.</p><p>As far back as the middle ages&mdash;before the land even bore name &ldquo;Slovakia&rdquo;&mdash;the sulfuric thermal waters were recognized for their healing potential, visited by Hungarian monarchs and written about in the books of healing men and scholars. The current infrastructure of the spa was constructed through the late 19th century and into the early 20th. This includes the prestigious Therima Palace Hotel and Napoleon Baths. The main site of which is pictured below.</p><p>The centuries-old reputation of these baths persists to astounding degree today. I sat on a bench before a sunny wall of the baths, watching people pass. From aged sufferers of arthritis to disabled children and their parents, all sorts of people walked in and out of those doors, putting faith in the healing waters of Pie&scaron;ťany. They travel from far abroad to soak away their ills or simply maintain good health.</p><p>Several water fountains adorn the complex, spilling mineral rich drinking water that is collected by visitors and locals alike. I watched one man fill his entire backpack with approximately seven water bottles brimming with the liquid. My interest peaked and I paced over to try it myself. Ladling a bit of the water up to my mouth with a hand, I nearly gagged with surprise at the taste. Sulfur pervaded, seeming to me like someone had dissolved rotten eggs throughout the entire water source. Knowing little of the health benefits sulfurous water, I had no motivation to fill my water bottle like others were doing.</p><p>Built in the 1930s, the Colonnade Bridge has a unique design, featuring separate covered and open walkways, multiple statues and small shops on each end. It is the gateway to the spas of Pie&scaron;ťany and visitors are greeted by a statue of the &ldquo;Crutch-breaker&rdquo;, as seen on the city&rsquo;s coat of arms, when they enter from city center. As I crossed this bridge, I passed a woman who walked with her dog. My headphones were in&mdash;a habit I don&rsquo;t normally partake in while traveling for this very reason&mdash;yet, I was fortunate enough to hear her through the music. She spoke to her dog in English! My head spun to look behind me. On her backpack was a Canadian flag patch, much like the one worn by the exchange student in my city who&rsquo;s from Quebec.</p><p>&ldquo;Pardon, but are you from Canada?&rdquo; I asked before the opportunity passed entirely.</p><p>&ldquo;Why, yes!&rdquo; She declared, &ldquo;Nice to meet you!&rdquo;</p><p>Short of relating the entire conversation, I feel there is no way to accurately describe my surprise other than to do it suddenly.</p><p>She was a Rotary exchange student in Chihuahua, Mexico 42 years ago. Sometime after she met her Slovak husband and moved here with him, living intermittently back in Canada for short times. She has traveled independently across the world since her exchange, early in her life as a young adventurer and more recently through her work in the medical field&hellip; She was a Rotary exchange student and I just met her on the street!</p><p>Needless to say, that encounter made my day, the rest of which was spent wandering the city parks. I found myself on an island between the Vah river and a canal. I passed a few individuals as I crossed the bridge onto the island, but no came near after that. The morning had exhibited miserable weather, grey clouds and chilly wind, but as I wandered this small bit of greenery on the river, the sun came out and it felt almost like Spring. I feel I have said that a lot, &ldquo;It felt like Spring&rdquo; or &ldquo;I want Spring to come&rdquo; and I do indeed feel a stronger desire for Spring this year. Winter hasn&rsquo;t been rough in the least bit, yet I long for the warm days and longer hours in which I can explore the places around me.</p><p>Anyway, as the sun struck my face, it suddenly became much too warm for my coat, I discarded my winter clothing and went to sit in the grass. There was no reason to move from such a pleasant spot in warming midday sun, yet I found it difficult to remain idle. So, I began to toy with the pebbles and sticks which littered the clearing around me. One thing led to another and I ended up with this little cottage. (As peaceful as it appears, balancing the rocks perfectly caused me no little bit of stress.)</p><p>I had a beautiful day in Pie&scaron;ťany. From that island park, I met with my host grandparents, we lunched and then headed back to Poprad. Much like Olomouc, I hope to visit again in the Spring or Summer. Maybe even giving the thermal baths a try.</p><p>Signed,</p><p>Andrew</p>"
        }
        ]